<?php
$a = array('學號'=>101, '姓名'=>'李雲毓', '性別'=>'女', '生日'=>'2000/3/14', '電話'=>'(02)2704-2762'); 
$b = array('學號'=>102, '姓名'=>'黃冠妮', '性別'=>'女', '生日'=>'2000/6/6', '電話'=>'(02)2093-8123');
$c = array('學號'=>103, '姓名'=>'韋國書', '性別'=>'男', '生日'=>'2000/7/15', '電話'=>'(02)2502-1314');
$d = array('學號'=>104, '姓名'=>'劉子芸', '性別'=>'女', '生日'=>'2000/8/7', '電話'=>'(04)2530-7996');
$e = array('學號'=>105, '姓名'=>'李政昀', '性別'=>'男', '生日'=>'2000/12/24', '電話'=>'(02)2740-8965');
$student = array($a, $b, $c, $d, $e);

echo "學號：".$student[4]['學號']."<br />";
echo "姓名：".$student[4]['姓名']."<br />";
echo "性別：".$student[4]['性別']."<br />";
echo "生日：".$student[4]['生日']."<br />";
echo "電話：".$student[4]['電話'];
?>