<?php
$student[0]['學號']=101;$student[0]['姓名']='李雲毓'; $student[0]['性別']='女'; $student[0]['生日']='2000/3/14'; $student[0]['電話']='(02)2704-2762';
$student[1]['學號']=102;$student[1]['姓名']='黃冠妮'; $student[1]['性別']='女'; $student[1]['生日']='2000/6/6'; $student[1]['電話']='(02)2093-8123';
$student[2]['學號']=103;$student[2]['姓名']='韋國書'; $student[2]['性別']='男'; $student[2]['生日']='2000/7/15'; $student[2]['電話']='(02)2502-1314';
$student[3]['學號']=104;$student[3]['姓名']='劉子芸'; $student[3]['性別']='女'; $student[3]['生日']='2000/8/7'; $student[3]['電話']='(04)2530-7996';
$student[4]['學號']=105;$student[4]['姓名']='李政昀'; $student[4]['性別']='男'; $student[4]['生日']='2000/12/24'; $student[4]['電話']='(02)2740-8965';

echo "學號：".$student[2]['學號']."<br />";
echo "姓名：".$student[2]['姓名']."<br />";
echo "性別：".$student[2]['性別']."<br />";
echo "生日：".$student[2]['生日']."<br />";
echo "電話：".$student[2]['電話'];
?>